In [13]:
import pandas as pd
import numpy as np
import csv
from datetime import datetime
from dateutil import parser
from sklearn import preprocessing
import matplotlib.pyplot as plt

In [24]:
#dataset = pd.read_csv("/Users/smph/Desktop/dataScience/project/daily_electricity_usage.csv", parse_dates=["date"],index_col=1)
dataset = pd.read_csv("/Users/smph/Desktop/dataScience/project/daily_electricity_usage.csv")
dataset['date'] = pd.to_datetime(dataset['date'])

In [25]:
dataset.head(5)

   Meter ID       date  total daily KW
0      1000 2009-07-14          11.203
1      1000 2009-07-15           8.403
2      1000 2009-07-16           7.225
3      1000 2009-07-17          11.338
4      1000 2009-07-18          11.306

In [9]:
#cols = dataset.columns
#cols = cols.map(lambda x: x.replace(' ', '_'))
#dataset.columns = cols

#### Splitting data per costumer

In [26]:
data = pd.DataFrame({'date':pd.date_range('2009-07-14',periods=536,freq='D')})
for i in range(1000,7445):
    S=dataset[dataset['Meter ID']==i][['date','total daily KW']]
    data=pd.merge(data,S,how='left',on='date')
for i in range(1,6446):
    data.columns.values[i]="ID"+str(999+i)

In [30]:
dataset.head(5)

   Meter ID       date  total daily KW
0      1000 2009-07-14          11.203
1      1000 2009-07-15           8.403
2      1000 2009-07-16           7.225
3      1000 2009-07-17          11.338
4      1000 2009-07-18          11.306

In [31]:
data.head(5)

,date,ID1000,ID1001,ID1002,ID1003,ID1004,ID1005,ID1006,ID1007,ID1008,...,ID7435,ID7436,ID7437,ID7438,ID7439,ID7440,ID7441,ID7442,ID7443,ID7444
0,2009-07-14,11.203,6.744,6.355,24.183,50.057,17.765,12.056,30.399,27.217,...,15.643,36.500,15.346,0.732,138.130,41.813,14.491,36.813,5.112,52.940
1,2009-07-15,8.403,6.949,8.972,26.659,48.813,19.801,17.169,23.976,31.996,...,14.667,29.443,26.156,0.685,115.893,31.572,12.597,40.492,18.233,35.582
2,2009-07-16,7.225,7.255,8.794,32.017,32.555,15.216,16.260,34.534,24.363,...,18.037,28.786,23.945,0.707,127.698,32.618,15.816,41.487,6.925,29.307
3,2009-07-17,11.338,7.190,8.306,33.032,46.727,23.418,14.813,19.251,23.122,...,11.512,31.394,23.118,0.655,142.211,36.614,13.162,43.986,5.370,40.986
4,2009-07-18,11.306,6.805,10.119,31.238,35.215,29.392,12.325,21.392,25.721,...,30.767,22.112,15.582,0.682,4.641,27.982,13.301,41.018,6.751,40.270

In [29]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 536 entries, 0 to 535
Columns: 6446 entries, date to ID7444
dtypes: datetime64[ns](1), float64(6445)
memory usage: 26.4 MB

In [32]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3291258 entries, 0 to 3291257
Data columns (total 3 columns):
Meter ID          int64
date              datetime64[ns]
total daily KW    float64
dtypes: datetime64[ns](1), float64(1), int64(1)
memory usage: 75.3 MB

In [ ]:
 nm